
function setup() {
	createCanvas(500, 400);
	background(51,54,49);
	noStroke();
	background(51,54,49);
	
	fill(137, 34, 138);                           //塗り
	ellipse(50, 200, 20, 20);                    //中心の○
	ellipse(50 + 20,   200 - 20,   20, 20);　　　//中心の○から,○1つ分右,○1つ分斜め上
	ellipse(50 + 20*2, 200 - 20*2, 20, 20);　　　//中心の○から,○2つ分右,○2つ分斜め上
	ellipse(50 + 20,   200 + 20,   20, 20);      //中心の○から,○1つ分右,○1つ分斜め下
	ellipse(50 + 20*2,  200 + 20*2, 20, 20);      //中心の○から,○2つ分左,○2つ分斜め下

}


function draw() {

}
